docs/diagrams/src/process_execution.puml
@startuml
!include style.puml

start
:Affectation des jurys;
repeat
  :Vérification des conflits;
backward:Correction manuelle;
:Mise à jour du planning;
repeat while (Conflits détectés ?) is (Oui)
-> Non;
:Validation du planning final;
:Impression et diffusion;
:Déroulement des soutenances;
:Évaluation des étudiants;
:Collecte des notes;
:Archivage manuel;
stop
@enduml
